# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек 
# отломить k долек, если разрешается сделать один разлом по прямой между дольками 
# (то есть разломить шоколадку на два прямоугольника)

m = int(input('Введите длину шоколадки: '))
n = int(input('Введите ширину шоколадки: '))
k = int(input('Сколько долек отломить?: '))

if m * n < k:
    print('Хотите слишком большой кусок, шоколадка меньше')
else:
    if k % m == 0 or k % n == 0:
        print('Можно разломить')
    else:
        print('Так разломить не получится')